---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterInfo.Dispose
source: html/b509e0ff-3e3f-f453-4ce1-9c4f0b1aea18.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.Dispose Method

Releases all resources used by the BalusterInfo

## Syntax (C#)
```csharp
public void Dispose()
```